{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "int32", "sparse": false, "batch_input_shape": [null, 64], "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "embedding_1", "config": {"input_length": 64, "mask_zero": false, "trainable": true, "dtype": "float32", "embeddings_constraint": null, "name": "embedding_1", "input_dim": 228878, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "activity_regularizer": null, "batch_input_shape": [null, 64], "embeddings_regularizer": null, "output_dim": 128}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "name": "reshape_1", "target_shape": [64, 128, 1]}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "padding": "valid", "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "filters": 128, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 128], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "padding": "valid", "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "filters": 128, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [4, 128], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "padding": "valid", "activation": "relu", "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "filters": 128, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [5, 128], "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [1, 1], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [62, 1], "padding": "valid"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [1, 1], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [61, 1], "padding": "valid"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"strides": [1, 1], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [60, 1], "padding": "valid"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": 1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"rate": 0.5, "noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"units": 2, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}