{"keras_version": "2.1.5", "config": {"layers": [{"inbound_nodes": [], "config": {"sparse": false, "dtype": "int32", "batch_input_shape": [null, 64], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"input_length": 64, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "trainable": true, "embeddings_constraint": null, "batch_input_shape": [null, 64], "input_dim": 36115, "name": "embedding_1", "activity_regularizer": null, "output_dim": 128, "dtype": "float32"}, "class_name": "Embedding", "name": "embedding_1"}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"trainable": true, "name": "reshape_1", "target_shape": [64, 128, 1]}, "class_name": "Reshape", "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_size": [3, 128], "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_constraint": null, "activation": "relu", "padding": "valid", "bias_regularizer": null, "name": "conv2d_1", "filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_size": [4, 128], "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_constraint": null, "activation": "relu", "padding": "valid", "bias_regularizer": null, "name": "conv2d_2", "filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_size": [5, 128], "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_constraint": null, "activation": "relu", "padding": "valid", "bias_regularizer": null, "name": "conv2d_3", "filters": 128, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"pool_size": [62, 1], "padding": "valid", "trainable": true, "strides": [1, 1], "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"pool_size": [61, 1], "padding": "valid", "trainable": true, "strides": [1, 1], "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"pool_size": [60, 1], "padding": "valid", "trainable": true, "strides": [1, 1], "name": "max_pooling2d_3", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "class_name": "Concatenate", "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout", "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "units": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_1"}], "name": "model_1", "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}