{"keras_version": "2.1.5", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "int32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 64]}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "embeddings_regularizer": null, "batch_input_shape": [null, 64], "input_length": 64, "trainable": true, "mask_zero": false, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "input_dim": 11599, "output_dim": 128, "dtype": "float32", "activity_regularizer": null, "embeddings_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [64, 128, 1], "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "strides": [1, 1], "kernel_size": [3, 128], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "relu", "filters": 128, "padding": "valid"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "strides": [1, 1], "kernel_size": [4, 128], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "relu", "filters": 128, "padding": "valid"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "strides": [1, 1], "kernel_size": [5, 128], "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "relu", "filters": 128, "padding": "valid"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [62, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [61, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [60, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": 1, "trainable": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "units": 2, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}, "class_name": "Model"}