{"config": {"output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "sparse": false, "name": "input_1", "dtype": "int32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"embeddings_regularizer": null, "input_length": 64, "name": "embedding_1", "dtype": "float32", "batch_input_shape": [null, 64], "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "mask_zero": false, "input_dim": 228879, "trainable": true, "output_dim": 128}, "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [64, 128, 1], "name": "reshape_1"}, "name": "reshape_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 128], "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "padding": "valid", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "filters": 128, "name": "conv2d_1", "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "conv2d_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [4, 128], "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "padding": "valid", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "filters": 128, "name": "conv2d_2", "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "conv2d_2", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [5, 128], "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}, "padding": "valid", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "filters": 128, "name": "conv2d_3", "use_bias": true, "trainable": true, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "conv2d_3", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [62, 1], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [1, 1]}, "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [61, 1], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [1, 1]}, "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [60, 1], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [1, 1]}, "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "units": 2, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.1.5", "class_name": "Model", "backend": "tensorflow"}