{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.5", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28], "dtype": "int32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"batch_input_shape": [null, 28], "output_dim": 128, "embeddings_regularizer": null, "input_length": 28, "mask_zero": false, "dtype": "float32", "input_dim": 11599, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_constraint": null, "activity_regularizer": null, "name": "embedding_1"}, "name": "embedding_1"}, {"class_name": "Reshape", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"trainable": true, "target_shape": [28, 128, 1], "name": "reshape_1"}, "name": "reshape_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [3, 128], "padding": "valid", "trainable": true, "bias_regularizer": null, "filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activity_regularizer": null, "name": "conv2d_1"}, "name": "conv2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [4, 128], "padding": "valid", "trainable": true, "bias_regularizer": null, "filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activity_regularizer": null, "name": "conv2d_2"}, "name": "conv2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_size": [5, 128], "padding": "valid", "trainable": true, "bias_regularizer": null, "filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activity_regularizer": null, "name": "conv2d_3"}, "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [26, 1], "name": "max_pooling2d_1"}, "name": "max_pooling2d_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [25, 1], "name": "max_pooling2d_2"}, "name": "max_pooling2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"strides": [1, 1], "padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [24, 1], "name": "max_pooling2d_3"}, "name": "max_pooling2d_3"}, {"class_name": "Concatenate", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]], "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "name": "concatenate_1"}, {"class_name": "Flatten", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1"}, {"class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.5, "noise_shape": null}, "name": "dropout_1"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"units": 2, "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "softmax", "activity_regularizer": null, "name": "dense_1"}, "name": "dense_1"}]}}