{"backend": "tensorflow", "config": {"output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "sparse": false, "dtype": "int32", "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"batch_input_shape": [null, 64], "name": "embedding_1", "activity_regularizer": null, "trainable": true, "input_length": 64, "embeddings_constraint": null, "input_dim": 228879, "mask_zero": false, "embeddings_regularizer": null, "dtype": "float32", "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "output_dim": 128}, "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [64, 128, 1], "name": "reshape_1"}, "name": "reshape_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_1", "kernel_size": [3, 128], "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "filters": 128}, "name": "conv2d_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "kernel_size": [4, 128], "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "filters": 128}, "name": "conv2d_2", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_3", "kernel_size": [5, 128], "bias_constraint": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "trainable": true, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "filters": 128}, "name": "conv2d_3", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [1, 1], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [62, 1]}, "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [1, 1], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [61, 1]}, "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [1, 1], "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [60, 1]}, "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 1}, "name": "concatenate_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.5, "noise_shape": null}, "name": "dropout_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "units": 2, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "name": "dense_1", "use_bias": true, "kernel_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "keras_version": "2.1.5", "class_name": "Model"}