{"keras_version": "2.1.5", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "int32", "batch_input_shape": [null, 28]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"embeddings_regularizer": null, "activity_regularizer": null, "output_dim": 128, "input_length": 28, "trainable": true, "name": "embedding_1", "dtype": "float32", "batch_input_shape": [null, 28], "mask_zero": false, "embeddings_constraint": null, "input_dim": 11599, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "reshape_1", "config": {"trainable": true, "target_shape": [28, 128, 1], "name": "reshape_1"}, "class_name": "Reshape", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "conv2d_1", "config": {"activity_regularizer": null, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "valid", "name": "conv2d_1", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [3, 128], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}}, "class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"activity_regularizer": null, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "valid", "name": "conv2d_2", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [4, 128], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}}, "class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"activity_regularizer": null, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "padding": "valid", "name": "conv2d_3", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 128], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}}, "class_name": "Conv2D", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [1, 1], "pool_size": [26, 1]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [1, 1], "pool_size": [25, 1]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "strides": [1, 1], "pool_size": [24, 1]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"trainable": true, "axis": 1, "name": "concatenate_1"}, "class_name": "Concatenate", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["max_pooling2d_2", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"units": 2, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}